// Вывести на экран соответствий между символами и их численными обозначениями в памяти компьютера.
package com.artempvn.m_3_cycles;
import java.math.*;
import java.io.*;
import static java.lang.Math.*;
public class Task_6 {	
public static void main (String [] args) {
for(int i=0;i<128;i++){
	char ch = (char) i;
	System.out.printf("Численное обозначение: %d; символ: %c \n",i,ch);		
	}			
}
	}

	